In [1]:
import pandas as pd

In [25]:
calls = pd.read_csv('calls.csv')

In [26]:
calls.head()

   78130 00821    98453 94494  01-09-2016 06:01:12   186
0  78298 91466  (022)28952819  01-09-2016 06:01:59  2093
1  97424 22395  (022)47410783  01-09-2016 06:03:51  1975
2  93427 40118  (080)33118033  01-09-2016 06:11:23  1156
3  90087 42537  (080)35121497  01-09-2016 06:17:26   573
4  97427 87999  (04344)322628  01-09-2016 06:19:28  2751

In [9]:
calls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5212 entries, 0 to 5211
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   78130 00821          5212 non-null   object
 1   98453 94494          5212 non-null   object
 2   01-09-2016 06:01:12  5212 non-null   object
 3   186                  5212 non-null   int64
dtypes: int64(1), object(3)
memory usage: 163.0+ KB

In [10]:
calls.columns

Index(['78130 00821', '98453 94494', '01-09-2016 06:01:12', '186'], dtype='object')

In [27]:
calls['date'] = calls['01-09-2016 06:01:12'].apply(lambda x: pd.Timestamp(x).strftime('%B-%d-%Y %I:%M:%S %p'))

In [28]:
calls.head(20)

,78130 00821,98453 94494,01-09-2016 06:01:12,186,date
0,78298 91466,(022)28952819,01-09-2016 06:01:59,2093,January-09-2016 06:01:59 AM
1,97424 22395,(022)47410783,01-09-2016 06:03:51,1975,January-09-2016 06:03:51 AM
2,93427 40118,(080)33118033,01-09-2016 06:11:23,1156,January-09-2016 06:11:23 AM
3,90087 42537,(080)35121497,01-09-2016 06:17:26,573,January-09-2016 06:17:26 AM
4,97427 87999,(04344)322628,01-09-2016 06:19:28,2751,January-09-2016 06:19:28 AM
5,(080)45291968,90365 06212,01-09-2016 06:30:36,9,January-09-2016 06:30:36 AM
6,78132 18081,77956 90632,01-09-2016 06:39:03,3043,January-09-2016 06:39:03 AM
7,98453 46196,94005 06213,01-09-2016 06:40:20,2457,January-09-2016 06:40:20 AM
8,78290 99865,89071 31755,01-09-2016 06:46:56,9,January-09-2016 06:46:56 AM
9,(04344)228249,(080)43901222,01-09-2016 06:50:04,2329,January-09-2016 06:50:04 AM
10,(080)62164823,74066 93594,01-09-2016 06:52:07,300,January-09-2016 06:52:07 AM
11,(0821)6141380,90366 69257,01-09-2016 06:54:44,2147,January-09-2016 06:54:44 AM
12,98446 66723,83019 53227,01-09-2016 06:56:16,129,January-09-2016 06:56:16 AM
13,90088 09624,93434 31551,01-09-2016 06:57:44,133,January-09-2016 06:57:44 AM
14,93427 56500,98447 12671,01-09-2016 07:03:45,29,January-09-2016 07:03:45 AM
15,(040)26738737,90194 00845,01-09-2016 07:12:39,94,January-09-2016 07:12:39 AM
16,(080)67362492,(04344)316423,01-09-2016 07:24:45,2258,January-09-2016 07:24:45 AM
17,90192 87313,(080)33251027,01-09-2016 07:28:01,110,January-09-2016 07:28:01 AM
18,97421 07528,97399 92703,01-09-2016 07:30:50,2918,January-09-2016 07:30:50 AM
19,78130 00821,98453 94494,01-09-2016 07:31:20,1560,January-09-2016 07:31:20 AM

In [21]:
calls[['date']].min()

date    April-09-2016 01:00 PM
dtype: object

In [6]:
texts = pd.read_csv('texts.csv')

In [8]:
texts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9071 entries, 0 to 9070
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   97424 22395          9071 non-null   object
 1   90365 06212          9071 non-null   object
 2   01-09-2016 06:03:22  9071 non-null   object
dtypes: object(3)
memory usage: 212.7+ KB

In [ ]:
df['Dat'] = pd.to_datetime(df['OPEN TIME'],format= '%H:%M:%S' ).dt.time